![New York City schoolbus](schoolbus.jpg)

Photo by [Jannis Lucas](https://unsplash.com/@jannis_lucas) on [Unsplash](https://unsplash.com).
<br>

Every year, American high school students take SATs, which are standardized tests intended to measure literacy, numeracy, and writing skills. There are three sections - reading, math, and writing, each with a **maximum score of 800 points**. These tests are extremely important for students and colleges, as they play a pivotal role in the admissions process.

Analyzing the performance of schools is important for a variety of stakeholders, including policy and education professionals, researchers, government, and even parents considering which school their children should attend. 

You have been provided with a dataset called `schools.csv`, which is previewed below.

You have been tasked with answering three key questions about New York City (NYC) public school SAT performance.

In [ ]:
# Re-run this cell 
import pandas as pd

# Read in the data
schools = pd.read_csv("schools.csv")

# Preview the data
schools.head()

# Start coding here...
# Add as many cells as you like...

Collecting jupyter_contrib_nbextensions
  Using cached jupyter_contrib_nbextensions-0.7.0.tar.gz (23.5 MB)
  Preparing metadata (setup.py): started
  Preparing metadata (setup.py): finished with status 'done'
Requirement already satisfied: jupyter in c:\users\breno\anaconda3\lib\site-packages (1.0.0)
Collecting contrib
  Obtaining dependency information for contrib from https://files.pythonhosted.org/packages/8f/7d/62e5220e638d2b0defd9d5fd52c70cb89e372519d7941dd5cc7924b8c7b9/contrib-0.3.0-py3-none-any.whl.metadata
  Using cached contrib-0.3.0-py3-none-any.whl.metadata (6.2 kB)

ERROR: Could not find a version that satisfies the requirement nbextension (from versions: none)
ERROR: No matching distribution found for nbextension

,school_name,borough,building_code,average_math,average_reading,average_writing,percent_tested
0,"New Explorations into Science, Technology and ...",Manhattan,M022,657,601,601,NaN
1,Essex Street Academy,Manhattan,M445,395,411,387,78.9
2,Lower Manhattan Arts Academy,Manhattan,M445,418,428,415,65.1
3,High School for Dual Language and Asian Studies,Manhattan,M445,613,453,463,95.9
4,Henry Street School for International Studies,Manhattan,M056,410,406,381,59.7

### 01 - Which NYC schools have the best math results?
- The best math results are at least 80% of the *maximum possible score of 800* for math.
- Save your results in a pandas DataFrame called best_math_schools, including "school_name" and "average_math" columns, sorted by "average_math" in descending order.

In [ ]:

# ETL on data: Check for missing values in the dataset
schools.isna().sum()

school_name         0
borough             0
building_code       0
average_math        0
average_reading     0
average_writing     0
percent_tested     20
dtype: int64

In [ ]:
# Display information about the DataFrame, including data types and non-null counts
schools.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 375 entries, 0 to 374
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   school_name      375 non-null    object
 1   borough          375 non-null    object
 2   building_code    375 non-null    object
 3   average_math     375 non-null    int64
 4   average_reading  375 non-null    int64
 5   average_writing  375 non-null    int64
 6   percent_tested   355 non-null    float64
dtypes: float64(1), int64(3), object(3)
memory usage: 20.6+ KB

In [102]:
# Replace NaN values with 0 to handle missing data
schools = schools.fillna(0)

In [ ]:
# Group by school_name and calculate the sum of average_math scores
best_math_schools_df = pd.DataFrame(
    schools.groupby("school_name")["average_math"].sum().sort_values(ascending=[False])
    ).reset_index()

# Select the top 10 schools based on average_math scores
best_math_schools = best_math_schools_df.head(10)

In [ ]:
# Display the top 10 schools with the best math scores from NY
best_math_schools

              school_name  average_math
0  Stuyvesant High School           754

### 02 - What are the top 10 performing schools based on the combined SAT scores?

- Save your results as a pandas DataFrame called top_10_schools containing the "school_name" and a new column named "total_SAT", with results ordered by "total_SAT" in descending order ("total_SAT" being the sum of math, reading, and writing scores).

In [ ]:
# Calculate the total SAT score by summing math, reading, and writing scores
schools['total_SAT'] = schools['average_math'] + schools['average_reading'] + schools['average_writing']
schools.head(3)

,school_name,borough,building_code,average_math,average_reading,average_writing,percent_tested,total_SAT
0,"New Explorations into Science, Technology and ...",Manhattan,M022,657,601,601,0.0,1859
1,Essex Street Academy,Manhattan,M445,395,411,387,78.9,1193
2,Lower Manhattan Arts Academy,Manhattan,M445,418,428,415,65.1,1261

In [ ]:
# Select the top 10 schools based on total_SAT scores and reset the index
top_10_schools = schools[["school_name", "total_SAT"]].sort_values(by="total_SAT",ascending=False).reset_index(drop=True).head(10)
top_10_schools

                                         school_name  total_SAT
0                             Stuyvesant High School       2144
1                       Bronx High School of Science       2041
2                Staten Island Technical High School       2041
3  High School of American Studies at Lehman College       2013
4                        Townsend Harris High School       1981
5  Queens High School for the Sciences at York Co...       1947
6                     Bard High School Early College       1914
7                     Brooklyn Technical High School       1896
8                      Eleanor Roosevelt High School       1889
9  High School for Mathematics, Science, and Engi...       1889

### 03 - Which single borough has the largest standard deviation in the combined SAT score?

- Save your results as a pandas DataFrame called largest_std_dev.
- The DataFrame should contain one row, with:
    - "borough" - the name of the NYC borough with the largest standard deviation of "total_SAT".
    - "num_schools" - the number of schools in the borough.
    - "average_SAT" - the mean of "total_SAT".
    - "std_SAT" - the standard deviation of "total_SAT".
- Round all numeric values to two decimal places.

In [ ]:
# Calculate the standard deviation, mean, and count of total_SAT for each borough
stats = schools.groupby("borough")["total_SAT"].agg(['std', 'mean', 'count']).reset_index()

In [ ]:
# Identify the borough with the largest standard deviation in total_SAT scores
largest_std_dev_borough = stats.loc[stats['std'].idxmax()]

In [ ]:
# Create a new DataFrame with the results, including borough, num_schools, average_SAT, and std_SAT
largest_std_dev = pd.DataFrame({
    "borough": [largest_std_dev_borough['borough']], 
    "num_schools" : [largest_std_dev_borough['count']],
    "average_SAT" : [round(largest_std_dev_borough['mean'], 2)], 
    "std_SAT" : [round(largest_std_dev_borough['std'], 2)]
}).set_index("borough")

In [ ]:
# Display the borough with the largest standard deviation in total_SAT scores
largest_std_dev

           num_schools  average_SAT  std_SAT
borough
Manhattan           89      1340.13   230.29